CommonSecurityLog
| where TimeGenerated > ago(24h)
| summarize Total=count(),makeset(Activity)
| mv-expand set_Activity
| extend Activity=tostring(set_Activity)
| join kind=innerunique (CommonSecurityLog
| where TimeGenerated > ago(24h)
| summarize Count=count() by Activity) on $left.Activity == $right.Activity
| extend percentagePerActivity = round(todouble(Count)/Total*100,2)
| project Activity, percentagePerActivity, totalPerActivity=Count, Total
| sort by totalPerActivity desc